import 'foodModel.dart';

var foods = [
  new FoodModel(
    nameFoodString: 'กระเพาหมู',
    detailFoodString: "เนื้อหมูสะอาด สดจากฟาร์มที่ผ่านการตรวจสอบและมีรสชาติดี",
    urlImageString: 'http://androidthai.in.th/mua/lmage/food1.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ข้าวผัด',
      detailFoodString: "ข้าวหอมมะลิที่คัดสรรเมล็ดพันธุื์ มีคุณภาพของไทย",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food2.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ผัดพริกแกงหมู',
      detailFoodString: "พริกแกง สด ใหม่ สะอาด เริศรส",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food3.jpg'

  ),
  new FoodModel(
      nameFoodString: 'คะน้าหมูกรอบ',
      detailFoodString: "หมูกรอบ ทอดใหม่ทุกวัน สด กรอบนอกนุ่มใน",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food4.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ปลาทอด',
      detailFoodString: "ปลาสด ตาใส เนื้อแน่น หวาน หอม",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food5.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ข้าวจี่',
      detailFoodString: "เข้าจี่ นับเป็นของกินเล่นอย่างหนึ่ง จัดได้อยู่ในประแภทอาหารที่มีวิธีการทำแบบปิ้งหรือย่าง สมัยก่อนนิยมใช้ข้าวเย็นหรือข้าวที่เหลือจากการกินมื้อเย็นวันก่อนมาปั้น เอาไม้เสียบตรงกลาง และนำไปปิ้งกับถ่านไฟแดง",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food31.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ข้าวบ่ายนำ้มัน',
      detailFoodString: "ข้าวบ่าย หมายถึงอาหารประเภทกินด่วนแบบโบราณ มีข้าวเหนียวนึ่งและไส้ ซึ่งอาจจะเป็นปลาทูนึ่ง นำมาย่างไฟ หรือทอด หมูเค็ม จิ๊นแห้ง (จิ๊นเกื๋อ) นํ้าพริกแดง ผักกาดดอง อย่างใดอย่างหนึ่ง หรือจะใส่ตามชอบก็ได้ ส่วนใหญ่นิยมไส้จิ๊นแห้งกับน้ำพริกตาแดง หรือไส้ปลาทูย่างหรือทอด นำไปย่างกับเตาถ่าน หรือไม่ย่างก็ได้ อาจเรียกชื่อตามไส้ เช่น ข่าวบ่ายปลาทู ข้าวบ่ายจิ๊นแห้ง ถ้าใช้ไส้เป็นน้ำพริกผสมกับน้ำมันพืชหรือน้ำมันหมูเล็กน้อย นำไปย่างไฟ เรียกว่า ข้าวบ่ายน้ำมัน จะใช้นำพริกตาแดง หรือทำน้ำพริก โดยใช้พริกขี้หนูแห้ง กระเทียม หอมแดง นำมาย่างไฟ โขลกให้ละเอียด ใส่เกลือและน้ำมันพืชหรือน้ำมันหมู แล้วนำไปย่างไฟ (นงเยาว์ วิริยะ, สัมภาษณ์, 3 กรกฎาคม 2550)",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food32.jpg'

  ),
  new FoodModel(
      nameFoodString: 'จิ๊นส้มหมก',
      detailFoodString: "จิ๊นส้ม หรือ แหนม ทำมาจากเนื้อสัตว์ เช่น เนื้อหมู เนื้อวัว เนื้อควาย เรียกชื่อตามเนื้อสัตว์ เช่น จิ๊นส้มหมู จิ๊นส้มงัว จิ๊นส้มก้าง ปัจุจุบัน นิยมใช้เนื้อหมู บางแห่งเรียก หมูส้ม สามารถนำมารับประทานเป็นกับข้าว โดยนำไปย่างไฟทั้งห่อ เรียกว่า จิ๊นส้มหมก หรือนำไปปรุงอาหารได้หลายชนิด เช่น คั่วจิ๊นส้มใส่ไข่ เจียวผักปลัง และคั่วฟักเพกาอ่อน (อุดม รุ่งเรืองศรี, 2542, หน้า 1879; เสาวภา ทาแก้ว, สัมภาษณ์, 2 กรกฎาคม 2550)",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food33.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ปูอ่อง',
      detailFoodString: "ปูอ่อง เป็นอาหารพื้นบ้านของชาวล้านนา ชาวไทลื้อ ชาวไทเขิน แม้แต่ในภาคเหนือของลาว ปูอ่องจะอร่อยที่สุดช่วงฤดูเกี่ยวข้าว เนื่องจากปูมีมันมาก การปรุงโดยใส่ต้นหอมซอย จะทำให้ปูอ่องเพิ่มกลิ่นหอม และน่ารับประทานยิ่งขึ้น (เสาวภา ทาแก้ว, สัมภาษณ์, 2 กรกฎาคม 2550; อากิก, 2548)",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food34.jpg'

  ),
  new FoodModel(
      nameFoodString: 'ไส้อั่ว',
      detailFoodString: "คำว่า อั่ว หมายถึง แทรก หรือยัดไว้ตรงกลาง ไส้อั่ว จึงหมายถึงไส้ที่มีการนำสิ่งของยัดไว้ การทำไส้อั่ว นิยมใช้ไส้หมูและเนื้อหมู การทำไส้อั่ว เป็นวิธีการถนอมอาหาร ให้สามารถรับประทานได้นานขึ้น คือประมาณ 1-2 วัน (รัตนา พรหมพิชัย, 2542, 7257) แต่ถ้าเก็บไว้ในที่เย็น หรือปัจจุบัน มีการบรรจุถุงแบบสูญญากาศ ก็เก็บไว้ได้นานมากยิ่งขึ้น การทำให้ไส้อั่วสุก จะใช้วิธีปิ้ง หรือทอดก็ได้ (ศรีนวล อภิวงศ์, สัมภาษณ์, 9 กรกฎาคม 2550)",
      urlImageString: 'http://androidthai.in.th/mua/lmage/food35.jpg'

  ),

];


